Masmiseim36/nxpSDK/devices/MKW34A4/drivers/fsl_lin_lpuart.c
lin_status_t LIN_LPUART_GoToSleepMode(LPUART_Type *base)
{
    lin_status_t retVal = LIN_SUCCESS;

    uint32_t instance = LIN_LPUART_GetInstance(base);

    /* Get the current LIN state of this LPUART instance. */
    lin_state_t *linCurrentState = g_linStatePtr[instance];

    /* Update node's current state to SLEEP_MODE. */
    linCurrentState->currentNodeState = LIN_NODE_STATE_SLEEP_MODE;

    /* Set Receive data not inverted */
    LIN_LPUART_SetRxDataPolarity(base, false);

    DisableIRQ(g_linLpuartRxTxIrqId[instance]);
#ifdef LPUART_ERR_IRQS
    DisableIRQ(g_linLpuartErrIrqId[instance]);
#endif
#if defined(FSL_FEATURE_LPUART_HAS_LIN_BREAK_DETECT) && FSL_FEATURE_LPUART_HAS_LIN_BREAK_DETECT
    LIN_LPUART_DisableInterrupts(base, kLPUART_LinBreakInterruptEnable);
#endif

    LIN_LPUART_DisableInterrupts(base, (kLPUART_RxDataRegFullInterruptEnable | kLPUART_FramingErrorInterruptEnable));
    LIN_LPUART_EnableInterrupts(base, kLPUART_RxActiveEdgeInterruptEnable);
    EnableIRQ(g_linLpuartRxTxIrqId[instance]);
#ifdef LPUART_ERR_IRQS
    EnableIRQ(g_linLpuartErrIrqId[instance]);
#endif

    return retVal;
}

lin_status_t LIN_LPUART_GotoIdleState(LPUART_Type *base)
{
    uint32_t instance = LIN_LPUART_GetInstance(base);
    /* Get the current LIN state of this LPUART instance. */
    lin_state_t *linCurrentState = g_linStatePtr[instance];

    /* Set Receive data not inverted */
    LIN_LPUART_SetRxDataPolarity(base, false);

    DisableIRQ(g_linLpuartRxTxIrqId[instance]);
#ifdef LPUART_ERR_IRQS
    DisableIRQ(g_linLpuartErrIrqId[instance]);
#endif
#if defined(FSL_FEATURE_LPUART_HAS_LIN_BREAK_DETECT) && FSL_FEATURE_LPUART_HAS_LIN_BREAK_DETECT
    /* Set Break char detect length as 13 bits minimum */
    base->STAT |= LPUART_STAT_LBKDE_MASK;
    LIN_LPUART_EnableInterrupts(base, kLPUART_LinBreakInterruptEnable);
#endif

    LIN_LPUART_EnableInterrupts(base, (kLPUART_RxDataRegFullInterruptEnable | kLPUART_FramingErrorInterruptEnable));

    LIN_LPUART_DisableInterrupts(base, kLPUART_RxActiveEdgeInterruptEnable);

    EnableIRQ(g_linLpuartRxTxIrqId[instance]);
#ifdef LPUART_ERR_IRQS
    EnableIRQ(g_linLpuartErrIrqId[instance]);
#endif
    /* Change node's current state to IDLE */
    linCurrentState->currentNodeState = LIN_NODE_STATE_IDLE;

    return LIN_SUCCESS;
}

lin_status_t LIN_LPUART_SendWakeupSignal(LPUART_Type *base)
{
    uint32_t instance = LIN_LPUART_GetInstance(base);

    /* Get the current LIN state of this LPUART instance. */
    const lin_state_t *linCurrentState = g_linStatePtr[instance];
    lin_status_t retVal = LIN_SUCCESS;

    if (linCurrentState->isBusBusy == false)
    {
        /* Send a wakeup signal */
        LIN_LPUART_WriteByte(base, s_wakeupSignal[instance]);
    }
    else
    {
        retVal = LIN_BUS_BUSY;
    }

    return retVal;
}

lin_status_t LIN_LPUART_MasterSendHeader(LPUART_Type *base, uint8_t id)
{
    lin_status_t retVal = LIN_SUCCESS;
    bool checkSleepMode = false;

    uint32_t instance = LIN_LPUART_GetInstance(base);
    /* Get the current LIN user config structure of this LPUART instance. */
    const lin_user_config_t *linUserConfig = g_linUserconfigPtr[instance];

    /* Get the current LIN state of this LPUART instance. */
    lin_state_t *linCurrentState = g_linStatePtr[instance];

    /* Check whether current mode is sleep mode */
    checkSleepMode = (LIN_NODE_STATE_SLEEP_MODE == linCurrentState->currentNodeState);
    /* Check if the current node is slave */
    if ((linUserConfig->nodeFunction == (bool)LIN_SLAVE) || (0x3FU < id) || checkSleepMode)
    {
        retVal = LIN_ERROR;
    }
    else
    {
        /* Check if the LIN bus is busy */
        if (linCurrentState->isBusBusy)
        {
            retVal = LIN_BUS_BUSY;
        }
        else
        {
            linCurrentState->currentId = id;

            /* Make parity for the current ID */
            linCurrentState->currentPid = LIN_ProcessParity(id, LIN_MAKE_PARITY);

            /* Send Break field */
            linCurrentState->currentNodeState = LIN_NODE_STATE_SEND_BREAK_FIELD;
            linCurrentState->currentEventId = LIN_NO_EVENT;
            linCurrentState->isBusBusy = true;

#if defined(FSL_FEATURE_LPUART_HAS_LIN_BREAK_DETECT) && FSL_FEATURE_LPUART_HAS_LIN_BREAK_DETECT
            /* Set Break char detect length as 13 bits minimum */
            base->STAT |= LPUART_STAT_LBKDE_MASK;
            LIN_LPUART_EnableInterrupts(base, kLPUART_LinBreakInterruptEnable);
#endif
            LIN_LPUART_QueueBreakChar(base);
        }
    }

    return retVal;
}

lin_status_t LIN_LPUART_EnableIRQ(LPUART_Type *base)
{
    lin_status_t retVal = LIN_SUCCESS;
    uint32_t instance = LIN_LPUART_GetInstance(base);
    /* Get the current LIN state of this LPUART instance. */
    const lin_state_t *linCurrentState = g_linStatePtr[instance];

    DisableIRQ(g_linLpuartRxTxIrqId[instance]);

    if (linCurrentState->currentNodeState == LIN_NODE_STATE_SLEEP_MODE)
    {
        /* Enable RX Input Active Edge interrupt */
        LIN_LPUART_EnableInterrupts(base, kLPUART_RxActiveEdgeInterruptEnable);
    }
    else
    {
#if defined(FSL_FEATURE_LPUART_HAS_LIN_BREAK_DETECT) && FSL_FEATURE_LPUART_HAS_LIN_BREAK_DETECT
        LIN_LPUART_EnableInterrupts(base, kLPUART_LinBreakInterruptEnable);
#endif
        LIN_LPUART_EnableInterrupts(base, (kLPUART_RxDataRegFullInterruptEnable | kLPUART_FramingErrorInterruptEnable));
        EnableIRQ(g_linLpuartRxTxIrqId[instance]);
#ifdef LPUART_ERR_IRQS
        EnableIRQ(g_linLpuartErrIrqId[instance]);
#endif
    }
    return retVal;
}

lin_status_t LIN_LPUART_DisableIRQ(LPUART_Type *base)
{
    lin_status_t retVal = LIN_SUCCESS;

    uint32_t instance = LIN_LPUART_GetInstance(base);

    /* Get the current LIN state of this LPUART instance. */
    const lin_state_t *linCurrentState = g_linStatePtr[instance];

    if (linCurrentState->currentNodeState == LIN_NODE_STATE_SLEEP_MODE)
    {
        /* Disable RX Input Active Edge interrupt */
        LIN_LPUART_DisableInterrupts(base, kLPUART_RxActiveEdgeInterruptEnable);
    }
    else
    {
#if defined(FSL_FEATURE_LPUART_HAS_LIN_BREAK_DETECT) && FSL_FEATURE_LPUART_HAS_LIN_BREAK_DETECT
        LIN_LPUART_DisableInterrupts(base, kLPUART_LinBreakInterruptEnable);
#endif
        LIN_LPUART_DisableInterrupts(base,
                                     (kLPUART_RxDataRegFullInterruptEnable | kLPUART_FramingErrorInterruptEnable));

        DisableIRQ(g_linLpuartRxTxIrqId[instance]);
#ifdef LPUART_ERR_IRQS
        DisableIRQ(g_linLpuartErrIrqId[instance]);
#endif
    }
    /* Disable LPUART interrupt. */
    return retVal;
}

lin_status_t LIN_LPUART_AutoBaudCapture(uint32_t instance)
{
    /* Get base address of the LPUART instance. */
    LPUART_Type *base = g_linLpuartBase[instance];
    /* Get the current LIN user config structure of this LPUART instance. */
    const lin_user_config_t *linUserConfig = g_linUserconfigPtr[instance];
    /* Get the current LIN state of this LPUART instance. */
    lin_state_t *linCurrentState = g_linStatePtr[instance];
    lin_status_t retVal = LIN_BUS_BUSY;
    uint32_t tmpTime = 0U;

